{
    "id": "item1",
    "band": "Morphine",
    "active": "Years active: 1989 - 1999",
    "text": "Morphine was an American alternative rock group formed by Mark Sandman, Dana Colley, and Jerome Deupree in Cambridge, Massachusetts in 1989. After five successful albums and extensive touring, they disbanded in 1999 after frontman Sandman died of a heart attack. Founding members have reformed into the band Vapors of Morphine, maintaining much of the original style and sound. Morphine combined blues and jazz elements with more traditional rock arrangements, giving the band an unusual sound. Sandman sang distinctively in a \"deep, laid-back croon\", and his songwriting featured a prominent beat influence. The band themselves coined the label \"low rock\" to describe their music, which involved \"a minimalist, low-end sound that could have easily become a gimmick: a \"power trio\" not built around the sound of an electric guitar. Instead, with sly intelligence, Morphine expanded its offbeat vocabulary on each album. The band enjoyed positive critical appraisal, but met with mixed results commercially. In the United States the band was embraced and promoted by the indie rock community, including public and college radio stations and MTV's 120 Minutes, which the band once guest-hosted, but received little support from commercial rock radio and other music television programs. This limited their mainstream exposure and support in their home country, while internationally they enjoyed high-profile success, especially in Belgium, Portugal, France and Australia.",
    "cast": [
      {
        "name": "Mark Sandman",
        "photo": "mock/data/img/morphine/bands/sandman.jpg",
        "description": "Mark Sandman (September 24, 1952 - July 3, 1999) was an indie rock icon and longtime fixture in the Boston / Cambridge music scene, best known as the lead singer and bass player of the band Morphine."
      },
      {
        "name": "Dana Colley",
        "photo": "mock/data/img/morphine/bands/dana.jpg",
        "description": "Dana Colley (born October 17, 1961 in Portland, Maine) is an American musician, best known as the baritone and tenor saxophonist in the band Morphine."
      },
      {
        "name": "Jerome Deupree",
        "photo": "mock/data/img/morphine/bands/jerome.jpg",
        "description": "Jerome Deupree (born November 9, 1956 in Cincinnati, Ohio) is an American musician, based in Massachusetts. He is best known as the original drummer in the band Morphine."
      }
    ]
  }