[
  {
    "title": "Sandman collapsed on stage on July 3, 1999",
    "band": "Morphine",
    "style": "rock",
    "picture": "server/img/morphine/news/1.jpg",
    "video": {
      "title": "Buena",
      "link": "http://www.youtube.com/embed/Hx6aO-vdpNQ"
    },
    "interview": "server/interview/morphine/",
    "text": "Sandman collapsed on stage on July 3, 1999 at the Giardini del Principe in Palestrina, Lazio, Italy while performing with Morphine. His death, at the age of 46, was the result of a heart attack. His death has been attributed to cigarettes, heavy stress and the temperature of over 100 degrees Fahrenheit on the night of his death. He was survived by his girlfriend Sabine Hrechdakian, parents Robert and Guitelle Sandman and sister Martha Holmes. Morphine disbanded following his death, although the surviving members briefly toured with other musicians as Orchestra Morphine, a tribute to Sandman and in support of the posthumous release, The Night.Following Sandmans death, Hi-n-Dry became a commercial record label and studio, dedicated to recording and releasing work by Boston-area artists. The label and studio are managed by Sandmans former Morphine band mates Conway and Colley. Hi-n-Dry issued a retrospective box set of Sandmans music called Sandbox in 2004. Another four disc Morphine box set has been compiled but has not been released due to the sale of former Morphine label, Rykodisc, to Warner Brothers.In 2009, Colley, Deupree, and Boston musician Jeremy Lyons formed the group Vapors of Morphine. The band regularly performs in Boston and New Orleans."
  },
  {
    "title": "Flashback: Dave Grohl Plays First Gig With Nirvana in 1990",
    "band": "Nirvana",
    "style": "rock",
    "picture": "server/img/nirvana/news/1.jpg",
    "video": {
      "title": "Lithium (Scala & Kolacny Brothers cover)",
      "link": "http://www.youtube.com/embed/4oDkvnsNHUw"
    },
    "interview": "server/interview/morphine/",
    "text": "By the fall of 1990, the then three-year-old Nirvana had cycled through different band names and no less than five drummers before settling on their moniker and finding their groove with their final drummer Dave Grohl. Prior to the band members first encounter, the then 21-year-old Grohl was a veteran of the Washington, D.C. hardcore scene, serving as the drummer for Washington, D.C. punk band Scream. At the urging of Melvins frontman Buzz Osborne, Nirvanas singer-guitarist Kurt Cobain and bassist Krist Novoselic checked out a Scream show in San Francisco, which was their first time seeing Grohl perform live. Shortly afterward, Scream disbanded and Cobain and Novoselic invited Grohl to a session where they obviously clicked. Kurt was kind of a drummer himself. When he would play guitar or write songs, if you ever looked at his jaw, he would be moving his jaw back and forth, like he was playing the drums with his teeth. He heard in his head what he wanted from a rhythm, and thats a hard thing to articulate,' Grohl told Rolling Stone in 2001 about the groups difficulty in choosing a drummer and his eventually joining the band. 'I think one of the reasons they wanted me was that I sang backup vocals. I dont remember them saying, Youre in the band. We just continued."
  },
  {
    "title": "BadBadNotGood, Electric Brixton, gig review: Rooted in jazz, but branching out",
    "band": "BadBadNotGood",
    "style": "jazz",
    "picture": "server/img/badbadnotgood/news/1.jpg",
    "video": {
      "title": "'III' 'LP'",
      "link": "http://www.youtube.com/embed/l97mbF7J-r4"
    },
    "interview": "server/interview/morphine/",
    "text": "Ever since, back in 2011, black and white footage emerged on YouTube of Matthew Tavares, Chester Hansen and Alexander Sowinski playing jazz interpretations of Odd Future beats – a video which was picked up by Tyler, The Creator, garnering hundreds of thousands of views – critics and fans alike have been tripping over themselves trying to categorise exactly what kind of music BadBadNotGood make. Jazz fusion? Post-bop? Jazz-hop? Hip-jazz? It’s an inessential discussion, and places the Canadian band in boxes they easily outgrow. Undeniably, they’re rooted in jazz – the three of them met while studying it at Humber College – but their jazz is a mentality, a way of approaching performance and composition, rather than a collection of touchstones to habitually reach for. Since those Odd Future sessions, the band has collaborated with everyone from hip-hop heavyweight Ghostface Killah to Future Islands frontman Samuel Herring, seamlessly incorporating a range of genres: soul, funk, even house and a touch of shoegaze."
  }
]